# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#     *Пример:*

#     - [2, 3, 4, 5, 6] => [12, 15, 16];
#     - [2, 3, 5, 6] => [12, 15]

n = [2, 3, 4, 5, 6]
j = [2, 3, 5, 6]

def f(n):
    res = []
    for i in range(len(n)//2):
        res.append(n[i]*n[-1-i])
    if (len(n)) % 2 != 0:
        res.append(n[len(n)//2]**2)
    return res

print(f(n))
print(f(j))
