# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
#     Примеры:
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90


nums = [78, 55, 36, 90, 2]
max = nums[0]
i = 0
while i < len(nums):
    if nums[i] > max:
        max = nums[i]
    i+=1
    
print(max)